/*
	1. 마우스를 올리면 각각 hero 들이 bottom 0으로 움직이도록 해보세요.

	2. 마우스를 내리면 각각 hero들이 제자리에 돌아오게 해보세요.

	3. 클릭시에 클릭한 Hero는 밝아지고, 다른 Hero들은 어두워지게 만드세요.

	4. .hero-name에 클릭한 Hero의 이름이 적히도록 만드세요.

	5. 페이지 방문시에 아이언맨이 처음 default로 선택되어 있도록 만들어보세요.

	6. prev와 next를 클릭시 동작되게 해보세요.

	7. prev와 next를 클릭시 슬라이드가 끝에 도달했을때 다시 처음이나 마지막 슬라이드로 가도록 만들어보세요.
	마지막 슬라이드에서 right 클릭 : 첫 슬라이드
	첫 슬라이드에서 left 클릭 : 마지막 슬라이드

	8. prev와 next를 하나의 click이벤트로 묶어서 작성해보세요.
	$('.prev, .next').click

	9. 이미지를 클릭했을때와 연동되게 만드세요.

	10. 자동재생되게 만들어보세요.
*/
